app/controllers/user_communities_controller.rb

  def index
    @user_communities = UserCommunity.all
---
SELECT "user_communities".* FROM "user_communities"

  def create
    @user_community = UserCommunity.new(user_community_params)

    respond_to do |format|
      if @user_community.save
---
INSERT INTO "user_communities" ("created_at", "email", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 11 Jul 2015 14:57:55 UTC +00:00], ["email", "davso7@gmail.com"], ["name", "David Solano"], ["updated_at", Sat, 11 Jul 2015 14:57:55 UTC +00:00]]

    def set_user_community
      @user_community = UserCommunity.find(params[:id])
---
SELECT "user_communities".* FROM "user_communities" WHERE "user_communities"."id" = $1 LIMIT 1  [["id", "1"]]